Функционал: навигация по форумам
  Чтобы не взрывать пользователям мозг
  Ссылки должны указывать куда надо
  И всюду должно быть можно зайти

  Предыстория:
    Допустим у меня есть форум Главный
    И у меня есть подфорум Так себе на форуме Главный
    И у меня есть тема Сабж на форуме Главный c описанием "" и сообщением "Сообщение"
    
  Сценарий: Навигация по форумам вниз
    Допустим я зашел на список форумов
    Если я кликаю на "Главный"
    И я кликаю на "Так себе"
    То я должен быть на форуме Так себе

  Сценарий: Навигация по форумам вверх
    Допустим я зашел на форум Так себе
    Если я кликаю на "Вверх"
    И я кликаю на "Вверх"
    То я должен быть на списке форумов
  
  Сценарий: Вход в тему
    Допустим я зашел на форум Главный
    Если я кликаю на "Сабж"
    То я должен быть в теме Сабж

  Сценарий: Выход из темы
    Допустим я зашел в тему Сабж
    Если я кликаю на "Вверх"
    То я должен быть на форуме Главный

